import React from 'react';
import Image from 'next/image';
import styles from './Home.module.css';

export default function Home() {
  return (
    <div className="bg-[url('/images/background-homepage.jpg')] bg-cover bg-center bg-fixed relative min-h-screen">
      <div className=" xs:text-xl xs:max-w-42 xs:place-items-center pt-22 mb-80 relative text-center text-white max-w-52 lg:text-4xl lg:max-w-2xl font-bold font-sans italic">
        <pre className={styles.sentenceFont}>{`
      ;ותום חשכה ללא קול באין שחר
          .תפארת עזו נחלה של הכלל

         מרצד לו קיום במרחב היקום
           .מקטנות הקטן ועד למעבר

               עדין חסר הקים בחלל
                .ונמצא החסר שישנו

     ,הדרוג הבריאה ופירוק לפרטים
              .בפיצול היחיד לרבים
            יש מן הכח הבילתי נגמר
                 .מתחדש ונובע לעד
          
            מאת דב ארמוני, מתוך המשכן
          `}</pre>
      </div>
      <div className="bg-gray-200 pb-5">
        <div className="py-10 text-center text-black font-bold text-2xl">
          דב ארמוני
        </div>
        <div className="xs:mx-12 lg:mx-20 border-4 border-gray-100 rounded-xl bg-white">
          <img
            src="/images/jonnySinsDoctor.jpg"
            alt="Jonny Sins Doctor"
            className="float-start mx-4 my-4 rounded-lg"
          />
          <p dir="rtl" className="mt-2 mr-4 mb-4">
            {`
            אבא שלנו דב ארמוני היה אדם יוצא דופן.

יום אחד לפני שנתיים, התקיימה אזכרה לאימא שלנו. מכיוון שהודיעו בבוקר על גשם צפוי, אבא החליט לוותר על האזכרה בבית העלמין מתוך התחשבות באנשים והזמין את כולם שיגיעו אליו ישר הביתה.
אני, בכל זאת נסעתי לבית קברות וראיתי אותו עומד שם לבדו בגשם, קורא אותיות נשמה. ללא מילים שמתי את ידי על כתפו. כשסיימנו לומר קדיש, ראיתי שכמה קברים מקברה של אימא, בשטח של "תל קימל", המקום שבו קבורים כל יקירנו, ישנה מצבה יפה, חדשה אבל ללא שם. אמרתי לו, "מה זאת הפלישה הזאת, מעניין של מי הקבר הזה?" הוא שתק ולבסוף הפטיר לעברי בשחוק קל, שזה בעצם הקבר שלו.
 " חסכתי לכם" הוא אמר.
 "לפחות השארת לנו את הכיתוב" שאלתי?
 "נראה לך" הוא גיחך, "גם את הפונטים כבר בחרתי. כשאני אמות דבר עם וינקלר הסתת, יש לו את כל הפרטים".
הפרפקציוניזם הזה והרצון שלא להכביד, אפיינו אותו עד יומו האחרון.
`}
          </p>
          <p dir="rtl" className="ml-4 mr-4 mb-4">
            {`
עד גיל 48, שנים ספורות לאחר פטירתה של אימנו שהלכה לעולמה בטרם עת בגיל 45, היה אבא אדריכל ומהנדס עיר בחדרה ובנתניה ואומן שצייר ופיסל וכתב שירים, רובם שירי אהבה למאירה  אהובתו.
מגיל 48 ובמשך קרוב ל-40 שנה, נטש כמעט לגמרי את עולם האדריכלות והפך לסוג של מטפס הרים רוחני. ההרים שהוא בחר לטפס עליהם לא היו הרים של גרניט ובזלת, אלא, הרים של קדושה ורוח. הוא יצא לחפש ולגלות את החוויה המיסטית. הוא תר לאורכו ולרוחבו של הגלובוס, במטרה לפצח את מהות הקשר בין האדם לכוחות העליונים.

הוא עשה זאת גם מתוך חקירה עמוקה של ההיסטוריה והפילוסופיה שמאחורי כל דת ואמונה, אך גם מתוך התנסות בפרקטיקות המיסטיות השונות והפך בהם למומחה של ממש. עם זאת, יש לומר שבנוסף לעומק האינטלקטואלי והרוחני, למסעות שלו תמיד נלווה מימד הרפתקני, שהיה בו תמהיל של צירופי מקרים ובחירות אמיצות.
הוא סיפר לי שעוד בשנות ה-80 של המאה הקודמת, ראה מודעה על עמוד ברחוב תל אביבי, בהקשר של מדיטציה טרנסצנדנטאלית והוא החליט מיד להצפין לכפר של מודטים בצפון הארץ וללמוד מהם את הטכניקה ומכיוון שהיה לו כשרון מיוחד בחיבורם של גוף ונפש ,"קפץ כיתות" והפך לסידא שבקי בשיטות של קפיצה וריחוף.
אבל, הוא לא הסתפק בכך ונסע רחוק עוד יותר, לאוניברסיטה של מהרישי יוגי באייווה שבארה"ב. שם, כמו תמיד, בדרך מקרה נקלע לפרויקט של הקמת המקדש הגדול לקהילת המאמינים, שבדיוק חיפשו עבורו אדריכל שהוא גם מודט. כמובן שאבא הפך לאדריכל הזה וכמובן שהוא פתר להם בעיה הנדסית סבוכה שאיימה להשבית את הפרויקט כולו וכך נעשה לחבר פקולטה מהמניין והשתתף בתכנון המיזם במשך חצי שנה.
משם לא ארכה הדרך ליתר התמחות בתורות המזרח, הינדואיזם ובודהיזם בדגש על הבודהיזם הטיבטי. הוא שהה במנזרים בתאילנד וביפן ולאחר מכן שב לארץ. 
`}
          </p>
          <p dir="rtl" className="ml-4 mr-4 mb-4">
            {`
פה, הוא נלפת בעולם הקבלה והמיסטיקה היהודית ושתה בצמא את הרצאותיה של פרופ. חביבה פדיה ואת תורתם של המקובלים היהודים הגדולים ואף התמחה בסוג של מדיטציה יהודית שהיתה קרובו לבית מדרשו של אברהם אבולעפיה.
כמו בכל דבר שעשה, הוא העמיק בתורת הנסתר, כשאת רוב הלמידה עשה לבד, בבדידות של תלמיד חכם אמיתי, ביושבו שעות ארוכות על כתבים וספרים, כשהוא תמיד מקפיד לשתות ישר מהבאר ולפענח את המקורות הראשוניים ולא ללמוד חס וחלילה מתוך פרשנותו של מלומד אחר, באופן בלתי אמצעי.
בשלב מסוים הוא נכבש על ידי המיסטיקה המוסלמית ובעיקר הסופיזם הנקשבנדי. הוא נסע לתורכיה ולקפריסין התורכית, התפלל וחולל עם דרווישים ובכל מקום שהגיע, נפשו נגעה בנפשותיהם של אנשים אחרים שכמוהו, כמהו לחוויה המיסטית.
ב-8 שנים האחרונות, הוא חזר למיסטיקה הבודהיסטית דרך הז'וקשאן, תרגם ספר חשוב שנכתב בטיבטית עתיקה והוציא אותו לאור.

אבא שלנו דב ארמוני, לא עשה עניין ממסעותיו הרוחניים וגם לא ממש תיעד אותם בצורה מסודרת. הוא אמנם השאיר אלבומי תמונות והרבה יצירות אבל אין תיעוד שלו, מנקודת מבטו, למסעו הרוחני המדהים והמסקרן. מה שיש אלו סיפורים ואנקדוטות קורעות, ששמות את המיסטיקה בתוך הפרספקטיבה של החיים האמיתיים.
כך נחשפנו למלחמה על הקוקו שלו במנזר בתאילנד שבסופו נאלץ לוותר ולהתקרח, למשימת קבוץ הנדבות במנזר ביפן שנכשל בה כישלון חרוץ ושבגינו עמד להיות מסולק בידי הנזיר הראשי וללילה זרוע הכוכבים בקפריסין עם כל השיחים הסופים שנאספו מקצווי ארץ ושלאחר כמה ימים של חומוס ופול הרעידו את הלילה, עד כדי כך שאבא הלך לישון במחסן .
הוא הרחיק למכסיקו לפגוש שני שמאנים במערה, לאכול איתם פטריות ולחלום איתם ביחד את טיסת הקונדור וטס לדרום אפריקה לפגוש מכשף ואת בנו של מלך זולו. שם, בקושי רב נמלט בזכות עורמה ותעוזה מחתונה עם צעירה מצודדת בתו של ראש השבט ועל זה הוא אמר לי שעוד יסופר " איך מנעתי מלחמה בין מדינת ישראל לשבט הזולו".
`}
          </p>
          <p dir="rtl" className="ml-4 mr-4 mb-4">
            {`אבא היה לא רק מיסטיקן וחוקר, אלא גם אומן. הוא צייר ופיסל, כתב תסריטים ושירים ותרגם יצירות חשובות. פסגת יצירתו היא אולי הסדרה בת 12 הציורים שבהם תיאר את חזון המרכבה מספר יחזקאל. זו היצירה שמחברת בין יכולותיו כצייר, לבין מהותו כמיסטיקן.

ועדיין יותר מכל דבר אחר, מה שחולל את מסעו הרוחני ושאליו חזר תמיד בכל דבר שעשה, היתה אהבתו הגדולה לאימא. הם הכירו כשהיו בשנות ה-20 המוקדמות לחייהם, נישאו וחיו ביחד 25 שנה. מאז מותה, מדי שנה היה כותב לה שיר אהבה, שאת חלקם פרסם בספר שהוציא. גם השנה ממש לפני מספר שבועות, ביקש ממני להגיע לכאן ולהקריא לה שיר. השיר האחרון שכתב לאהובתו.

המחלה הכתה בו בחטף ובעוצמה והוא דעך לנו בין הידיים בשבועות ספורים. דליה ואני ליווינו את האיש החכם והאמיץ הזה בדרכו, מרקו פולו של הנפש והרוח.
כל הדברים שלמד וידע, עזרו לו כשניצב בפני המוות. הוא לא היה מריר או מאוכזב או אפילו עצוב. את המוות הפיסי של הגוף, לא ראה כסוף פסוק.
לפני כמה ימים כשהטלטל בין העולם הזה והעולם הבא, הוא התעורר לפתע ופקח את עיניו.
"אשל" הוא אמר, "המלאכים רוצים לישון, הם רוצים לישון, תגיד להם שישכבו לידי, זה מאד חשוב".

אבא יקר ואהוב, נוח בשלום על משכבך. סוף סוף תוכל להיפגש עם אימא ולהתאחד עימה וגם תפגוש שם את יונג שהקריאה הביקורתית של כתביו היתה המיזם האחרון שלך ותוכל להסביר לו ישירות, איפה הוא טעה ואתה צדקת...`}
          </p>
          <p dir="rtl" className="ml-4 mr-4 mb-4">
            {`יהיה זכרך ברוך`}
          </p>
          <p dir="rtl" className="ml-4 mr-4 mb-4 text-center">
            {`מתוך ההספד שנשא בנו אשל ביום קבורתו 6/12/22`}
          </p>
        </div>
      </div>
    </div>
  );
}
